In [1]:
import pandas as pd

orders_columns = ['order_id', 'order_date', 'customer_id', 'order_status']

orders = pd.read_csv('C:/Users/Shalini/data_eng/data/retail_db/orders/part-00000', 
    names=orders_columns)

In [3]:
orders.columns

Index(['order_id', 'customer_id', 'order_date', 'order_status'], dtype='object')

In [8]:
orders.groupby('order_status')['order_id'].agg(['count'])

                 count
order_status
CANCELED          1428
CLOSED            7556
COMPLETE         22899
ON_HOLD           3798
PAYMENT_REVIEW     729
PENDING           7610
PENDING_PAYMENT  15030
PROCESSING        8275
SUSPECTED_FRAUD   1558

In [2]:
orders

       order_id             order_date  customer_id     order_status
0             1  2013-07-25 00:00:00.0        11599           CLOSED
1             2  2013-07-25 00:00:00.0          256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0        12111         COMPLETE
3             4  2013-07-25 00:00:00.0         8827           CLOSED
4             5  2013-07-25 00:00:00.0        11318         COMPLETE
...         ...                    ...          ...              ...
68878     68879  2014-07-09 00:00:00.0          778         COMPLETE
68879     68880  2014-07-13 00:00:00.0         1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0         2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0        10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0         5533         COMPLETE

[68883 rows x 4 columns]

In [4]:
# To crete a new column in the dataframe using the existing columns we can use the apply function
# The apply function takes a lambda function as an argument and applies it to each row of the dataframe
# The lambda function takes a row as an argument and returns a value that will be used to populate the new column which is order_month in this case
orders['order_month'] = orders.apply(lambda order: order['order_date'][0:7], axis=1)
orders

,order_id,order_date,customer_id,order_status,order_month
0,1,2013-07-25 00:00:00.0,11599,CLOSED,2013-07
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2013-07
2,3,2013-07-25 00:00:00.0,12111,COMPLETE,2013-07
3,4,2013-07-25 00:00:00.0,8827,CLOSED,2013-07
4,5,2013-07-25 00:00:00.0,11318,COMPLETE,2013-07
...,...,...,...,...,...
68878,68879,2014-07-09 00:00:00.0,778,COMPLETE,2014-07
68879,68880,2014-07-13 00:00:00.0,1117,COMPLETE,2014-07
68880,68881,2014-07-19 00:00:00.0,2518,PENDING_PAYMENT,2014-07
68881,68882,2014-07-22 00:00:00.0,10000,ON_HOLD,2014-07
68882,68883,2014-07-23 00:00:00.0,5533,COMPLETE,2014-07

In [6]:
# Let's group by the orders data frame by order_month and order_status and count the number of orders in each group
orders.groupby(['order_month', 'order_status'])['order_id'].agg(['count']).reset_index()

    order_month     order_status  count
0       2013-07         CANCELED     22
1       2013-07           CLOSED    161
2       2013-07         COMPLETE    515
3       2013-07          ON_HOLD     81
4       2013-07   PAYMENT_REVIEW     19
..          ...              ...    ...
112     2014-07   PAYMENT_REVIEW     54
113     2014-07          PENDING    517
114     2014-07  PENDING_PAYMENT    979
115     2014-07       PROCESSING    561
116     2014-07  SUSPECTED_FRAUD    101

[117 rows x 3 columns]